tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_lpi2c.c
    /* Look up instance number */
    instance = LPI2C_GetInstance(base);

    /* Save base and instance. */
    handle->completionCallback = callback;
    handle->userData           = userData;

    /* Save this handle for IRQ use. */
    s_lpi2cMasterHandle[instance] = handle;

    /* Set irq handler. */
    s_lpi2cMasterIsr = LPI2C_MasterTransferHandleIRQ;

    /* Clear internal IRQ enables and enable NVIC IRQ. */
    LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterIrqFlags);

#ifdef LPI2C_IRQS
    /* Enable NVIC IRQ, this only enables the IRQ directly connected to the NVIC.
     In some cases the LPI2C IRQ is configured through INTMUX, user needs to enable
     INTMUX IRQ in application code. */
    (void)EnableIRQ(kLpi2cIrqs[instance]);
#endif
#ifdef LPI2C_MASTER_IRQS
    (void)EnableIRQ(kLpi2cMasterIrqs[instance]);
#endif
}

static status_t LPI2C_TransferStateMachineSendCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams)
{
    assert(handle->remainingBytes > 0U);
    assert(stateParams != NULL);
    uint16_t sendval;

    /* Make sure there is room in the tx fifo for the next command. */
    if (0U == (stateParams->txCount)--)
    {
        stateParams->state_complete = true;
        return kStatus_Success;
    }

    /* Issue command. buf is a uint8_t* pointing at the uint16 command array. */
    sendval  = (uint16_t)handle->buf[0];
    sendval |= (((uint16_t)handle->buf[1]) << 8U);
    base->MTDR = sendval;
    handle->buf++;
    handle->buf++;

    /* Count down until all commands are sent. */
    if (--handle->remainingBytes == 0U)
    {
        /* Choose next state and set up buffer pointer and count. */
        if (0U != handle->transfer.dataSize)
        {
            /* Either a send or receive transfer is next. */
            handle->state          = (uint8_t)kTransferDataState;
            handle->buf            = (uint8_t *)handle->transfer.data;
            handle->remainingBytes = (uint16_t)handle->transfer.dataSize;
            if (handle->transfer.direction == kLPI2C_Read)
            {
                /* Disable TX interrupt */
                LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterTxReadyFlag);
                /* Issue command to receive data. A single write to MTDR can issue read operation of
                    0xFFU + 1 byte of data at most, so when the dataSize is larger than 0x100U, push
                    multiple read commands to MTDR until dataSize is reached. */
                size_t tmpRxSize = handle->transfer.dataSize;
                while (tmpRxSize != 0U)
                {
                    LPI2C_MasterGetFifoCounts(base, NULL, &stateParams->txCount);

#if I2C_RETRY_TIMES != 0U
                    uint32_t waitTimes = I2C_RETRY_TIMES;
#endif
                    /*
                     * $Branch Coverage Justification$
                     * The transmission commands will not exceed FIFO SIZE.(will improve)
                     */
                    while ((size_t)FSL_FEATURE_LPI2C_FIFO_SIZEn(base) == stateParams->txCount) /* GCOVR_EXCL_BR_LINE */
                    {
                        LPI2C_MasterGetFifoCounts(base, NULL, &stateParams->txCount); /* GCOVR_EXCL_LINE */

#if I2C_RETRY_TIMES != 0U
                        if (--waitTimes == 0U)
                        {
                            return kStatus_LPI2C_Timeout;
                        }
#endif
                    }

                    if (tmpRxSize > 256U)
                    {
                        base->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)LPI2C_MTDR_DATA(0xFFU);
                        tmpRxSize -= 256U;
                    }
                    else
                    {
                        base->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)LPI2C_MTDR_DATA(tmpRxSize - 1U);
                        tmpRxSize  = 0U;
                    }
                }
            }
        }
        else
        {
            /* No transfer, so move to stop state. */
            handle->state = (uint8_t)kStopState;
        }
    }

    return kStatus_Success;
}

static void LPI2C_TransferStateMachineReadCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams)
{
    assert(handle->transfer.dataSize >= 1U);
    assert(stateParams != NULL);

    /* Make sure there is room in the tx fifo for the read command. */
    if (0U == (stateParams->txCount)--)
    {
        stateParams->state_complete = true;
        return;
    }

    base->MTDR = (uint32_t)kRxDataCmd | LPI2C_MTDR_DATA(handle->transfer.dataSize - 1U);

    /* Move to transfer state. */
    handle->state = (uint8_t)kTransferDataState;
    if (handle->transfer.direction == kLPI2C_Read)
    {
        /* Disable TX interrupt */
        LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterTxReadyFlag);
    }
}

static void LPI2C_TransferStateMachineTransferData(LPI2C_Type *base,
                                                   lpi2c_master_handle_t *handle,
                                                   lpi2c_state_machine_param_t *stateParams)
{
    assert(stateParams != NULL);

    if (handle->transfer.direction == kLPI2C_Write)
    {
        /* Make sure there is room in the tx fifo. */
        if (0U == stateParams->txCount--)
        {
            stateParams->state_complete = true;
            return;
        }

        /* Put byte to send in fifo. */
        base->MTDR = *(handle->buf)++;
    }
    else
    {
        /* XXX handle receive sizes > 256, use kIssueReadCommandState */
        /* Make sure there is data in the rx fifo. */
        if (0U == stateParams->rxCount--)
        {
            stateParams->state_complete = true;
            return;
        }

